# coding=utf-8
################################################################################################################
# @file: regexutil.py
# @author: Sun Xinghua
# @date:  2016/11/21 9:44
# @version: Ver0.0.0.100
# @note:
################################################################################################################

import re
################################################################################################################
# @class：RegexUtility
# @author：Sun Xinghua
# @date：2016/11/21 9:44
# @note：
################################################################################################################
class RegexUtility:

    # 默认的ID正则表达式
    ID_REGEX='[^\w_\-][\'\"]{0,1}%s[\'\"]{0,1}\s*[%s]\s*[\'\"]{0,1}([\w_\-]+)[\'\"]{0,1}[^\w_\-]'

    ################################################################################################################
    # @functions：parse
    # @param： reg 正则表达式
    # @param： str 需要匹配的字符串
    # @return：none
    # @note：返回匹配的字符串
    ################################################################################################################
    @staticmethod
    def parse(reg, str):
        rec = re.compile(reg)
        return re.findall(rec, str)

    ################################################################################################################
    # @functions：getid
    # @param： name ID名称
    # @param： content 需要提取ID的对象
    # @param： split ID跟值的分隔符
    # @return：none
    # @note：从content中获取name的值
    ################################################################################################################
    @staticmethod
    def getid(name, content, split='=:'):
        reg = RegexUtility.ID_REGEX % (name, split)
        rec = re.compile(reg)
        try:
            values = re.findall(rec, content)
            if len(values) > 0:
                return values[0]
        except:
            pass
        return ''

    ################################################################################################################
    # @functions：match
    # @param： reg正则表达式
    # @param： str字符串
    # @return：匹配则返回True，否则返回False
    # @note：初始化内部变量
    ################################################################################################################
    @staticmethod
    def match(reg, str):
        try:
            return re.match(reg, str)
        except:
            print reg
            return False
    

    ################################################################################################################
    # @functions：search
    # @param： reg 正则
    # @param： str 字符串
    # @return：none或者匹配的字符串
    # @note：从字符串str中查找匹配reg字段，返回一个匹配的字符串，如果没有则返回None
    ################################################################################################################
    @staticmethod
    def search(reg,str):
        return re.search(reg,str)
        
